#게시글 sorting
#index, title, date, view, star
#가상 게시글 데이터 생성
board = [(0,["[교수학습개발센터] 12~14차 교수법워크숍 실시 안내                                       ","박예리 ","2018-09-28",6,3]),
         (1,["하이테크 소방 제연댐퍼 교체공사                                                      ","박민수 ","2018-09-28",2,0]),
         (2,["인하대학교 미래복합재 창의연구단 계약직 사무원 채용공고                                    ","노선영 ","2018-09-28",80,5]),
         (3,["2018년 하반기 전주시 학자금 대출이자 지원 안내                                         ","하슬기나","2018-09-28",19,1]),
         (4,["[교수학습개발센터] 2018-2학기 학습법 워크숍 운영 안내                                   ","김은진","2018-09-28",50,2]),
         (5,["2018-2학기 대학(원) 재학생 특별추가등록안내                                           ","원영재","2018-09-28",220,15]),
         (6,["[박물관] 2018년 2학기 역사기행 오얏꽃 향기가 가득한 도심을 거닐다, 동궐(東闕) (대학원생 및 교직원)","서원익","2018-09-27",143,8])
         ]
print("기본정렬")
board_default = dict(board)
print("번호"+'\t'+"제목"+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+"글쓴이"+'\t'+"작성일"+'\t'+'\t'+"조회"+'\t'+"추천")
print("------------------------------------------------------------------------------------------------------------------------")
for i in board_default.keys():
    print(str(i)+'\t'+board_default[i][0]+'\t'+board_default[i][1]+'\t'+board_default[i][2]+'\t'+str(board_default[i][3])+'\t'+str(board_default[i][4]))

print("조회수 정렬")
board_default = dict(sorted(board,key=lambda x:x[1][3],reverse=True))
print("번호"+'\t'+"제목"+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+"글쓴이"+'\t'+"작성일"+'\t'+'\t'+"조회"+'\t'+"추천")
print("------------------------------------------------------------------------------------------------------------------------")
for i in board_default.keys():
    print(str(i)+'\t'+board_default[i][0]+'\t'+board_default[i][1]+'\t'+board_default[i][2]+'\t'+str(board_default[i][3])+'\t'+str(board_default[i][4]))

print("추천 정렬")
board_default = dict(sorted(board,key=lambda x:x[1][4],reverse=True))
print("번호"+'\t'+"제목"+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+'\t'+"글쓴이"+'\t'+"작성일"+'\t'+'\t'+"조회"+'\t'+"추천")
print("------------------------------------------------------------------------------------------------------------------------")
for i in board_default.keys():
    print(str(i)+'\t'+board_default[i][0]+'\t'+board_default[i][1]+'\t'+board_default[i][2]+'\t'+str(board_default[i][3])+'\t'+str(board_default[i][4]))

